# Getting Financial Data - Pandas Datareader

### Introduction:

This time you will get data from a website.


### Step 1. Import the necessary libraries

In [1]:
pip install yfinance

Requirement already satisfied: yfinance in d:\anaconda3\lib\site-packages (0.2.21)
Requirement already satisfied: pandas>=1.3.0 in d:\anaconda3\lib\site-packages (from yfinance) (1.4.2)
Requirement already satisfied: multitasking>=0.0.7 in d:\anaconda3\lib\site-packages (from yfinance) (0.0.11)
Requirement already satisfied: beautifulsoup4>=4.11.1 in d:\anaconda3\lib\site-packages (from yfinance) (4.11.1)
Requirement already satisfied: html5lib>=1.1 in d:\anaconda3\lib\site-packages (from yfinance) (1.1)
Requirement already satisfied: pytz>=2022.5 in d:\anaconda3\lib\site-packages (from yfinance) (2023.3)
Requirement already satisfied: appdirs>=1.4.4 in d:\anaconda3\lib\site-packages (from yfinance) (1.4.4)
Requirement already satisfied: lxml>=4.9.1 in d:\anaconda3\lib\site-packages (from yfinance) (4.9.2)
Requirement already satisfied: frozendict>=2.3.4 in d:\anaconda3\lib\site-packages (from yfinance) (2.3.8)
Requirement already satisfied: requests>=2.26 in d:\anaconda3\lib\site-packages (from yfinance) (2.27.1)
Requirement already satisfied: numpy>=1.16.5 in d:\anaconda3\lib\site-packages (from yfinance) (1.21.5)
Requirement already satisfied: soupsieve>1.2 in d:\anaconda3\lib\site-packages (from beautifulsoup4>=4.11.1->yfinance) (2.3.1)
Requirement already satisfied: webencodings in d:\anaconda3\lib\site-packages (from html5lib>=1.1->yfinance) (0.5.1)
Requirement already satisfied: six>=1.9 in d:\anaconda3\lib\site-packages (from html5lib>=1.1->yfinance) (1.16.0)
Requirement already satisfied: python-dateutil>=2.8.1 in d:\anaconda3\lib\site-packages (from pandas>=1.3.0->yfinance) (2.8.2)
Requirement already satisfied: idna<4,>=2.5 in d:\anaconda3\lib\site-packages (from requests>=2.26->yfinance) (3.3)
Requirement already satisfied: urllib3<1.27,>=1.21.1 in d:\anaconda3\lib\site-packages (from requests>=2.26->yfinance) (1.26.9)
Requirement already satisfied: charset-normalizer~=2.0.0 in d:\anaconda3\lib\site-packages (from requests>=2.26->yfinance) (2.0.4)
Requirement already satisfied: certifi>=2017.4.17 in d:\anaconda3\lib\site-packages (from requests>=2.26->yfinance) (2021.10.8)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd
import numpy as np

import pandas_datareader as pdr #need ot upgrad to premium API to get data


import yfinance as yf

### Step 2. Create your time range (start and end variables). The start date should be 01/01/2015 and the end should today (whatever your today is).

In [3]:
start_date = '01-01-2015'
end_date = '6-21-2023'

date_range = pd.date_range(start=start_date, end=end_date, freq='D')

date_range

DatetimeIndex(['2015-01-01', '2015-01-02', '2015-01-03', '2015-01-04',
               '2015-01-05', '2015-01-06', '2015-01-07', '2015-01-08',
               '2015-01-09', '2015-01-10',
               ...
               '2023-06-12', '2023-06-13', '2023-06-14', '2023-06-15',
               '2023-06-16', '2023-06-17', '2023-06-18', '2023-06-19',
               '2023-06-20', '2023-06-21'],
              dtype='datetime64[ns]', length=3094, freq='D')

### Step 3. Get an API key for one of the APIs that are supported by Pandas Datareader, preferably for AlphaVantage.

If you do not have an API key for any of the supported APIs, it is easiest to get one for [AlphaVantage](https://www.alphavantage.co/support/#api-key). (Note that the API key is shown directly after the signup. You do *not* receive it via e-mail.)

(For a full list of the APIs that are supported by Pandas Datareader, [see here](https://pydata.github.io/pandas-datareader/readers/index.html). As the APIs are provided by third parties, this list may change.)

In [4]:
my_api = 'NPMHQG9E3COACKL6'
data = yf.download('AAPL', start ='2015-01-01', end='2023-06-21')

[*********************100%***********************]  1 of 1 completed

### Step 4. Use Pandas Datarader to read the daily time series for the Apple stock (ticker symbol AAPL) between 01/01/2015 and today, assign it to df_apple and print it.

In [5]:
df_apple = pd.DataFrame(data)

In [6]:
df_apple.head()

                 Open       High        Low      Close  Adj Close     Volume
Date
2015-01-02  27.847500  27.860001  26.837500  27.332500  24.531761  212818400
2015-01-05  27.072500  27.162500  26.352501  26.562500  23.840668  257142000
2015-01-06  26.635000  26.857500  26.157499  26.565001  23.842913  263188400
2015-01-07  26.799999  27.049999  26.674999  26.937500  24.177246  160423600
2015-01-08  27.307501  28.037500  27.174999  27.972500  25.106182  237458000

### Step 5. Add a new column "stock" to the dataframe and add the ticker symbol

In [7]:
df_apple['stock'] = 'AAPL'

In [8]:
df_apple.head()

,Open,High,Low,Close,Adj Close,Volume,stock
Date,,,,,,,
2015-01-02,27.847500,27.860001,26.837500,27.332500,24.531761,212818400,AAPL
2015-01-05,27.072500,27.162500,26.352501,26.562500,23.840668,257142000,AAPL
2015-01-06,26.635000,26.857500,26.157499,26.565001,23.842913,263188400,AAPL
2015-01-07,26.799999,27.049999,26.674999,26.937500,24.177246,160423600,AAPL
2015-01-08,27.307501,28.037500,27.174999,27.972500,25.106182,237458000,AAPL

### Step 6. Repeat the two previous steps for a few other stocks, always creating a new dataframe: Tesla, IBM and Microsoft. (Ticker symbols TSLA, IBM and MSFT.)

In [9]:
data_t = yf.download('TSLA', start ='2015-01-01', end='2023-06-21')
data_i = yf.download("IBM", start ='2015-01-01', end='2023-06-21' )
data_m = yf.download('MSFT', start ='2015-01-01', end='2023-06-21')

[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed

### Step 7. Combine the four separate dataFrames into one combined dataFrame df that holds the information for all four stocks

In [10]:
df_t = pd.DataFrame(data_t)
df_t['stock'] = 'TSLA'

df_i = pd.DataFrame(data_i)
df_i['stock'] = 'IBM'

df_m = pd.DataFrame(data_m)
df_m['stock'] = "MSFT"

In [11]:
df_all = pd.concat([df_apple, df_t, df_i, df_m], axis = 0)

In [12]:
df_all._is_view

False

In [13]:
df_all.head()

,Open,High,Low,Close,Adj Close,Volume,stock
Date,,,,,,,
2015-01-02,27.847500,27.860001,26.837500,27.332500,24.531761,212818400,AAPL
2015-01-05,27.072500,27.162500,26.352501,26.562500,23.840668,257142000,AAPL
2015-01-06,26.635000,26.857500,26.157499,26.565001,23.842913,263188400,AAPL
2015-01-07,26.799999,27.049999,26.674999,26.937500,24.177246,160423600,AAPL
2015-01-08,27.307501,28.037500,27.174999,27.972500,25.106182,237458000,AAPL

### Step 8. Shift the stock column into the index (making it a multi-level index consisting of the ticker symbol and the date).

In [14]:
df_all.set_index('stock', append=True, inplace=True)

In [15]:
df_all._is_view

False

### Step 7. Create a dataFrame called vol, with the volume values.

In [25]:
vol = df_all[['Volume']]

In [26]:
vol._is_view

True

In [27]:
vol

                     Volume
Date       stock
2015-01-02 AAPL   212818400
2015-01-05 AAPL   257142000
2015-01-06 AAPL   263188400
2015-01-07 AAPL   160423600
2015-01-08 AAPL   237458000
...                     ...
2023-06-13 MSFT    22951300
2023-06-14 MSFT    26003800
2023-06-15 MSFT    38899100
2023-06-16 MSFT    46533600
2023-06-20 MSFT    26375400

[8520 rows x 1 columns]

### Step 8. Aggregate the data of volume to weekly.
Hint: Be careful to not sum data from the same week of 2015 and other years.

In [28]:
vol.unstack().resample('W').sum()

                Volume
stock             AAPL       IBM       MSFT       TSLA
Date
2015-01-04   212818400   5779673   27913900   71466000
2015-01-11  1133010000  25578884  158825300  340644000
2015-01-18  1216906400  24329751  157088200  461988000
2015-01-25   794948000  32682062  137352600  243175500
2015-02-01  1863370800  34442689  437786800  235803000
...                ...       ...        ...        ...
2023-05-28   250355000  21030100  158230100  685490800
2023-06-04   286437400  24841300  128091600  591689300
2023-06-11   347825100  21173500  128213000  848137500
2023-06-18   333335700  24222400  158648100  811032600
2023-06-25    49799100   4271300   26375400  165611200

[443 rows x 4 columns]

In [29]:
#alternative method
vol.reset_index(inplace=True)

In [37]:
vol_col_year = vol.Date.dt.isocalendar().year
vol_col_week = vol.Date.dt.isocalendar().week

vol_weekly = pd.concat([vol,vol_col_year,vol_col_week],axis=1)
vol_weekly.groupby(['year','week','stock']).sum().unstack(level=2)

               Volume
stock            AAPL       IBM       MSFT       TSLA
year week
2015 1      212818400   5779673   27913900   71466000
     2     1133010000  25578884  158825300  340644000
     3     1216906400  24329751  157088200  461988000
     4      794948000  32682062  137352600  243175500
     5     1863370800  34442689  437786800  235803000
...               ...       ...        ...        ...
2023 21     250355000  21030100  158230100  685490800
     22     286437400  24841300  128091600  591689300
     23     347825100  21173500  128213000  848137500
     24     333335700  24222400  158648100  811032600
     25      49799100   4271300   26375400  165611200

[443 rows x 4 columns]

In [39]:
vol_weekly.pivot_table(values='Volume', index=['year','week'], columns='stock',aggfunc='sum')

stock            AAPL       IBM       MSFT       TSLA
year week
2015 1      212818400   5779673   27913900   71466000
     2     1133010000  25578884  158825300  340644000
     3     1216906400  24329751  157088200  461988000
     4      794948000  32682062  137352600  243175500
     5     1863370800  34442689  437786800  235803000
...               ...       ...        ...        ...
2023 21     250355000  21030100  158230100  685490800
     22     286437400  24841300  128091600  591689300
     23     347825100  21173500  128213000  848137500
     24     333335700  24222400  158648100  811032600
     25      49799100   4271300   26375400  165611200

[443 rows x 4 columns]

### Step 9. Find all the volume traded in the year of 2015

In [58]:
vol_year = vol_weekly.groupby(['year','stock']).Volume.sum().unstack(level=1)
vol_year.loc[2015:2015]

stock         AAPL         IBM        MSFT         TSLA
year
2015   52264199600  1156439400  9059455900  16323267000